app/controllers/api/cartedproducts_controller.rb

SELECT "carted_products".* FROM "carted_products" WHERE "carted_products"."user_id" = $1  [["user_id", 1]]
---
  def index
    @carted_product = CartedProduct.where(user_id:1)