app/controllers/api/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
  def index
    @order = Order.where(user_id:current_user.id)

SELECT "products".* FROM "products" WHERE "products"."title" = $1 LIMIT $2  [["title", "Magnemite"], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "product_id", "quantity", "subtotal", "tax", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @order = Order.new(
      user_id: current_user.id,
      product_id: Product.find_by(title: params[:name_of_product]).id,
      quantity: params[:quantity],
      subtotal: params[:quantity].to_i*Product.find_by(title: params[:name_of_product]).price,
      tax: Product.find_by(title: params[:name_of_product]).tax,
      total: params[:quantity].to_i*Product.find_by(title: params[:name_of_product]).price+Product.find_by(title: params[:name_of_product]).tax
    )

    @order.save