app/controllers/api/products_controller.rb

  def index
    # @product = Product.all
    search_term = params[:search]
    if search_term
      @products = Product.where("id > '#{search_term}'").order("id ASC")
    else
      @products = Product.all
    end

    @products = @products.order(id: :desc)
---
SELECT "products".* FROM "products" WHERE (price > 20 ORDER BY price) ORDER BY "products"."id" DESC
SELECT "products".* FROM "products"
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def create
    #makes new products
    @product = Product.new(
      title: params[:title],
      price: params[:price],
      image_url:params[:image_url],
      description: params[:description],
      inventory: params[:inventory]
      )

      if @product.save
---
INSERT INTO "products" ("title", "price", "image_url", "description", "created_at", "updated_at", "inventory") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def show
    @product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def delete
    @product = Product.find_by(id: params[:id])
    @product.destroy
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 13]]